data_simulations/03_novec/study_novec_u1e-1_d70/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "alpha.*"
    {   

            advectionScheme isoAdvection;

        vof2IsoTol      1e-8;
        surfCellTol     1e-8;
        writeVTK true;
        snapTol         1e-12;
        nAlphaBounds    5;  
        clip            true;
        nAlphaCorr      1;  
        nAlphaSubCycles 2;
        cAlpha          1;
		reconstructionScheme plicRDF;
    


	}   

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-09;
        relTol          0;
    }

    p_rghFinal
    {
        $p_rgh;
    }

    "U.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

}


PIMPLE
{
    momentumPredictor true;	// default true
    nCorrectors     3; 		// default 1
    nOuterCorrectors 2;		// default 1
    nNonOrthogonalCorrectors 0; // default 0
}


// ************************************************************************* //
