data_simulations/03_novec/study_novec_u1e-1_d70/system/interface
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2012
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out surface files with interpolated field data in VTK format, e.g.
    cutting planes, iso-surfaces and patch boundary surfaces.

    This file includes a selection of example surfaces, each of which the user
    should configure and/or remove.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/visualization/surfaces.cfg"

type            surfaces;
libs            (geometricVoF sampling);
writeControl    writeTime;

surfaceFormat   vtp;
fields       ();


surfaces
(
     interface
     {
         type        interface;
         interpolate false;
     }
);



// ************************************************************************* //
